app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Marco"], ["body", "Is a little teapot"], ["created_at", "2017-02-12 22:13:06.030717"], ["updated_at", "2017-02-12 22:13:06.030717"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(params[:post].permit(:title, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "Knows how to rock the validations.  And edit like a mfing rockstar!"], ["updated_at", "2017-02-12 23:56:32.353231"], ["id", 3]]